run/rockerPlate/rockingPlate_round_b/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (0      0   -0.17)//0
    (0.297  0   -0.17)//1
    (0.303  0   -0.17)//2
    (0.597  0   -0.17)//3
    (0.603  0   -0.17)//4
    (0.9    0   -0.17)//5
    (0.9    0   -0.018)//6
    (0.9    0   -0.012)//7
    (0.9    0   0)//8
    (0.603  0   0)//9
    (0.603  0   -0.012)//10
    (0.603  0   -0.018)//11
    (0.597  0   -0.018)//12
    (0.597  0   -0.015)//13
    (0.59912    0   -0.014121)//14
    (0.6    0   -0.012)//15
    (0.6    0   0)//16
    (0.303  0   -0.018)//17
    (0.303  0   -0.015)//18
    (0.30088   0   -0.014121)//19
    (0.3    0   -0.012)//20
    (0.3    0   0)//21
    (0.297  0   0)//22
    (0.297  0   -0.012)//23
    (0.297  0   -0.018)//24
    (0      0   0)//25
    (0      0   -0.012)//26
    (0      0   -0.018)//27
    
    
    (0      0.02   -0.17)//28
    (0.297  0.02   -0.17)//29
    (0.303  0.02   -0.17)//30
    (0.597  0.02   -0.17)//31
    (0.603  0.02   -0.17)//32
    (0.9    0.02   -0.17)//33
    (0.9    0.02   -0.018)//34
    (0.9    0.02   -0.012)//35
    (0.9    0.02   0)//36
    (0.603  0.02   0)//27
    (0.603  0.02   -0.012)//38
    (0.603  0.02   -0.018)//39
    (0.597  0.02   -0.018)//40
    (0.597  0.02   -0.015)//41
    (0.59912    0.02  -0.014121)//42
    (0.6    0.02   -0.012)//43
    (0.6    0.02   0)//44
    (0.303  0.02   -0.018)//45
    (0.303  0.02   -0.015)//46
    (0.30088   0.02   -0.014121)//47
    (0.3    0.02   -0.012)//48
    (0.3    0.02   0)//49
    (0.297  0.02   0)//50
    (0.297  0.02   -0.012)//51
    (0.297  0.02   -0.018)//52
    (0      0.02   0)//53
    (0      0.02   -0.012)//54
    (0      0.02   -0.018)//55
    
    
    (0.3    0   0.012)//56
    (0.3    0   -0.012)//57
    (0.303  0   -0.015)//58    
    (0.597  0   -0.015)//59
    (0.6    0   -0.012)//60
    (0.6    0   0.012)//61
    (0.599    0   -0.012)//62
    (0.597    0   -0.014)//63
    (0.303    0   -0.014)//64
    (0.301    0   -0.012)//65
    (0.301    0   0.012)//66
    (0.303    0   0.012)//67
    (0.597    0   0.012)//68
    (0.599    0   0.012)//69


    (0.3    0.02   0.012)//70
    (0.3    0.02   -0.012)//71
    (0.303  0.02   -0.015)//72    
    (0.597  0.02   -0.015)//73
    (0.6    0.02   -0.012)//74
    (0.6    0.02   0.012)//75
    (0.599  0.02   -0.012)//76
    (0.597  0.02   -0.014)//77
    (0.303  0.02   -0.014)//78
    (0.301  0.02   -0.013)//79
    (0.301  0.02   0.012)//80
    (0.303  0.02   0.012)//81
    (0.597  0.02   0.012)//82
    (0.599  0.02   0.012)//83


     );

blocks          
(
    hex (0  1  29 28 27 24 52 55) (120 1 100) simpleGrading (1 1 1)
    hex (1  2  30 29 24 17 45 52) (4 1 100) simpleGrading (1 1 1)
    hex (2  3  31 30 17 12 40 45) (120 1 100) simpleGrading (1 1 1)
    hex (3  4  32 31 12 11 39 40) (4 1 100) simpleGrading (1 1 1)
    hex (4  5  33 32 11 6  34 39) (120 1 100) simpleGrading (1 1 1)
    hex (11 6  34 39 10 7  35 38) (120 1 4) simpleGrading (1 1 1)
    hex (14 11 39 42 15 10 38 43) (4 1 4) simpleGrading (1 1 1)
    hex (12 11 39 40 13 14 42 41) (4 1 4) simpleGrading (1 1 1)
    hex (17 12 40 45 18 13 41 46) (120 1 4) simpleGrading (1 1 1)
    hex (24 17 45 52 19 18 46 47) (4 1 4) simpleGrading (1 1 1)
    hex (24 19 47 52 23 20 48 51) (4 1 4) simpleGrading (1 1 1)
    hex (27 24 52 55 26 23 51 54) (120 1 4) simpleGrading (1 1 1)
    hex (26 23 51 54 25 22 50 53) (120 1 4) simpleGrading (1 1 1)
    hex (23 20 48 51 22 21 49 50) (4 1 4) simpleGrading (1 1 1)
    hex (15 10 38 43 16 9  37 44) (4 1 4) simpleGrading (1 1 1)
    hex (10 7  35 38 9  8  36 37) (120 1 4) simpleGrading (1 1 1)
   
   hex (57 58 72 71 65 64 78 79) (8  1 2) simpleGrading (1 1 1)
   hex (58 59 73 72 64 63 77 78) (120 1 2) simpleGrading (1 1 1)
   hex (59 60 74 73 63 62 76 77) (8 1 2) simpleGrading (1 1 1)
   hex (57 65 79 71 56 66 80 70) (2 1 8) simpleGrading (1 1 1)
   hex (65 64 78 79 66 67 81 80) (8 1 8) simpleGrading (1 1 1)
   hex (64 63 77 78 67 68 82 81) (120 1 8) simpleGrading (1 1 1)
   hex (63 62 76 77 68 69 83 82) (8 1 8) simpleGrading (1 1 1)
   hex (62 60 74 76 69 61 75 83) (2 1 8) simpleGrading (1 1 1)
      
    
  
);
edges           
( 
   arc 14 15 (0.6  0      -0.011999)
   arc 42 43 (0.6  0.02   -0.011999)
   arc 13 14 (0.6  0      -0.011999)
   arc 41 42 (0.6  0.02   -0.011999)
   arc 19 20 (0.3  0      -0.011999)
   arc 47 48 (0.3  0.02   -0.011999)
   arc 18 19 (0.3  0      -0.011999)
   arc 46 47 (0.3  0.02   -0.011999)

   //arc 13 15 (0.3  0      -0.0101)
   //arc 33 35 (0.3  0.05      -0.0101)
   //arc 12 10 (0.6  0      -0.0101)
   //arc 32 30 (0.6  0.05      -0.0101)
   
   arc 58 57 (0.3  0      -0.011999)
   arc 72 71 (0.3  0.02   -0.011999)
   arc 59 60 (0.6  0      -0.011999)
   arc 73 74 (0.6  0.02   -0.011999)
);


boundary
(

  seaBed
    {
          type wall;
          faces
         (
          (25 22 50 53)	
	  (22 21 49 50)
	  (18 13 41 46)
	  (16 9 37 44)
	  (9  8  36 37)
	  (20 19 47 48)
	  (19 18 46 47)
	  (13 14 42 41)
	  (14 15 43 42)
	  (21 20 48 49)
	  (16 15 43 44)


         ) ;
    }
    

    
    
     frontBack
    {
          type empty;
          faces
         (
          (0  1  24 27)	
	  (28 29 52 55)
	  (1  2  17 24)
	  (29 30 45 52)
	  (2  3  12 17)
	  (30 31 40 45)
	  (3  4  11 12)
	  (31 32 39 40)
	  (4  5  6  11)
	  (32 33 34 39)
	  (11 6  7  10)
	  (39 34 35 38)
	  (17 12 13 18)
	  (45 40 41 46)
	  (27 24 23 26)
	  (55 52 51 54)
	  (26 23 22 25)
	  (54 51 50 53)
	  (23 20 21 22)
	  (51 48 49 50)
	  (15 10 9  16)
	  (43 38 37 44)
	  (10 7  8  9 )
	  (38 35 36 37)
	  (57 58 64 65)
          (71 72 78 79)
          (58 59 63 64)
          (72 73 77 78)
          (59 60 62 63)
          (73 74 76 77)
          (57 65 66 56)
          (71 79 80 70)
          (65 64 67 66)
          (79 78 81 80)
          (64 63 68 67)
          (78 77 82 81)
          (63 62 69 68)
          (77 76 83 82)
          (62 60 61 69)
          (76 74 75 83)
          (24 17 18 19)
          (52 45 46 47)
          (23 24 19 20)
          (51 52 47 48)
          (12 11 14 13)
          (40 39 42 41)
          (14 11 10 15)
          (42 39 38 43)
         ) ;
    }  
   
    soilDomainBottom
    {
          type wall;
          faces
         (
	  (0  1  29 28)	
	  (1  2  30 29)
	  (2  3  31 30)
	  (3  4  32 31)
	  (4  5  33 32)
	  	
         ) ;
    } 
 
    left
    {
    type wall;
        //  type cyclic;
        //  neighbourPatch  right;
         faces
        (
          (0  27 55 28)	
	  (27 26 54 55)
	  (26 25 53 54)

        );
          
    }
     
         right
    {
    type wall;
         // type cyclic;
         // neighbourPatch  left;
         faces
        (
          (7  8  36 35)	
	  (6  7  35 34)
	  (5  6  34 33)
        );
          
    }  

    
   
    rockerTop
    {
          type wall;
          faces
         (
          (56 66 80 70)	
	  (66 67 81 80)
	  (67 68 82 81)
	  (68 69 83 82)
	  (69 61 75 83)
           
         );
    }
    rocker
    {
          type wall;
          faces
         (
          (56 57 71 70)	
	  (57 58 72 71)
	  (58 59 73 72)
	  (59 60 74 73)
	  (60 61 75 74)

         ) ;
    }




);


mergePatchPairs 
(
);

// ************************************************************************* //
