run/rockerPlate/rockingPlate_round_b/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    seaBed
    {
	type             pressureFixedValue;
	value            uniform 0;

    }
    
    
    rockerTop
    {
	//type            zeroGradient;
	type             fixedValue;
	value            uniform 0;

    } 
    rocker
    {
	//type            zeroGradient;

	type             fixedValue;
	value            uniform 0;
    } 

 
    left
    {
        //type            cyclic; 
        type            zeroGradient;   
    }
    right
    {
        //type            cyclic; 
        type            zeroGradient;  
    }
    soilDomainBottom
    {
        type            zeroGradient;
    }
    
    frontBack
    { 
        type  		empty;
     }
}

// ************************************************************************* //
